package ru.nsu.stolyarov.interfaces;

/**
 * Очередь, в которую можно добавлять элементы.
 */
public interface QueueTimedGettable {
    /**
     * Попробовать изъять элемент из очереди за не более чем limit времени.
     * Если очередь пуста, то функция блокируется, пока не сможет выполнить операцию.
     *
     * @param limit (в миллисекундах) (неотрицательный) предел затрачиваемого времени на изъятие элемента.
     *              Если нулевое, то время не ограничено
     * @return значение элемента при успехе и -1 при неудаче
     */
    public int tryGet(long limit);
}
