package ru.nsu.stolyarov.interfaces;

/**
 * Очередь, из которой можно брать элементы.
 */
public interface QueueTimedAddable {
    /**
     * Попробовать добавить элемент в очередь за ограниченное время.
     * Если очередь переполнена, то функция блокируется, пока не сможет выполнить операцию.
     *
     * @param element добавляемый элемент (натуральное число)
     * @param limit (в миллисекундах) (неотрицательный) предел затрачиваемого времени на
     *              добавление элемента.
     *                Если нулевое, то время не ограничено
     * @return true если успешно, false иначе
     */
    public boolean tryAdd(int element, long limit);
}
